artillery/workload-02.yml
config:
  target: 'https://scc24appnortheurope57449.azurewebsites.net/rest'
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
  processor: "./test-utils.js"
  phases:
  - name: "Warm up"    
    duration: 20
    arrivalCount: 10
  - name: "Experiment"    
    duration: 60
    arrivalRate: 2               # set this value as high as possible for avoiding timeouts


  - name: 'Mixed browsing'
    weight: 40
    flow:
      - function: "selectUserSkewed"
      - post:                          # First: login as a user
         url: "/user/auth"
         name: "POST:/user/auth"
         
         headers:
            Content-Type: application/json
         json:
            user: "{{ user }}"
            pwd: "{{ pwd }}"
         capture:
            header: "set-cookie"
            as: "sessionId"
      - loop:                                  
       - get:                          # Get rentals for the user (assuming rentals + houses + discount initial page)
           url: "/user/{{ user }}/rentals?st=0&len=20"
           name: "GET:/user/*/rentals"
           headers:
             Accept: application/json
           capture: 
             json: "$"
             as: "rentalsLst"
        - get:                          # Get houses of the user 
           url: "/house/{{ id }}"
            headers:
             Accept: application/json
            capture: 
              json: "$"
              as: "housesLst"
        - get:                          # Get generic available houses available for a given start-date in a location
          url: "/house?location=Lisbon&starDate=01-01-2023"
            headers:
              Accept: application/json
            capture: 
              json: "$"
              as: "housesGenericLst"  
        - get:                          # Get  list of discounted rentals in the near future (2 weeks)
          url: "/house/discount"
            headers:
              Accept: application/json
            capture: 
              json: "$"
              as: "rentalsDiscountLst"  

        - function: "decideNextAction"
        ################################# Search location
        - get:                          
            url: "/house?location={{ location }}&starDate={{ initDate }}&endDate={{ endDate }}"
            headers:
              Accept: application/json
            capture: 
              json: "$"
              as: "housesLst"
            ifTrue: "nextAction == 1"
        - function: "selectHouse"
        ################################# Check questions
        - get:                          
            url: "/house/{{ houseId }}/question"
            name: "GET:/house/*/question"
            headers:
              Accept: application/json
            ifTrue: "houseId and afterNextAction == 1"
        ################################# Post questions
        - post:                          
            url: "/house/{{ houseId }}/question"
            name: "POST:/house/*/question"
            headers:
              Accept: application/json
              Content-Type: application/json
            json:
              userId: "{{ id }}"
              message: "{{ text }}"

            ifTrue: "houseId and afterNextAction == 2"
        ################################# Reserve house
        - get:                                           # get free periods for selected house
            url: "/house/{{ houseId }}"   
            name: "GET:/house/*/rental"
            headers:
              Content-Type: application/json
              Accept: application/json
            capture: 
              json: "$"
              as: "house"
            ifTrue: "houseId and afterNextAction == 3"
        - function: "selectPeriod"

        - post:                                          # reserve selected house in selected slot
            url: "/house/{{ houseId }}/rental"
            name: "POST:/house/*/rental/"
            headers:
              Content-Type: application/json
              Accept: application/json
            json: "{{rental}}"

            ifTrue: "rental and afterNextAction == 3"

        whileTrue: "random80"